import { useState, } from "react";

function Header() {
  const url = [
    {
      name: "ГЛАВНАЯ",
      link: "/",
      target: null
    },
    {
      name: "ДОКУМЕНТАЦИЯ",
      link: "/docs",
      target: null
    },
    {
      name: "СЕРВЕР ПОДДЕРЖКИ",
      link: "https://discord.gg/8p8NYhparv",
      target: "_blank"
    },
    {
      name: "СТАТИСТИКА",
      link: "/stats",
      target: null
    }
  ]

  const link = [
    {
      name: "СМЕНИТЬ ТЕМУ",
      type: "button",
      icon: null,
      link: null
    }
  ]

  const svg = {
    system: 'M3 7C3 5.34315 4.34315 4 6 4H18C19.6569 4 21 5.34315 21 7H19C19 6.44772 18.5523 6 18 6H6C5.44772 6 5 6.44772 5 7V15C5 15.5523 5.44772 16 6 16H12V19H4C2.89543 19 2 18.1046 2 17C2 16.4477 2.44772 16 3 16V7ZM14 11.4C14 10.0745 15.0745 9 16.4 9H19.6C20.9255 9 22 10.0745 22 11.4V19.6C22 20.9255 20.9255 22 19.6 22H16.4C15.0745 22 14 20.9255 14 19.6V11.4ZM16.4 11C16.1791 11 16 11.1791 16 11.4V19.6C16 19.8209 16.1791 20 16.4 20H19.6C19.8209 20 20 19.8209 20 19.6V11.4C20 11.1791 19.8209 11 19.6 11H16.4Z',
    dark: 'M3.56919 17.899C6.00627 20.9577 10.6032 22.5249 14.4371 21.4944C19.7184 20.0748 22.8546 14.6371 21.4419 9.34879C20.4163 5.50925 16.7623 2.30794 12.8972 1.72508C12.0906 1.60343 11.4907 2.45663 11.8772 3.17591C13.7463 6.65415 13.8985 9.63111 12.4039 12.2224C10.9093 14.8137 8.25773 16.1702 4.31421 16.2892C3.49864 16.3138 3.06049 17.2605 3.56919 17.899ZM19.5294 9.86308C20.6595 14.0937 18.1506 18.4439 13.9255 19.5796C11.5166 20.2271 8.24543 19.5841 6.18501 18.0833C9.62359 17.5318 12.5695 15.8979 14.118 13.2133C15.6665 10.5285 15.5997 7.16411 14.3572 3.90724C16.6859 4.94272 18.8849 7.45046 19.5294 9.86308Z',
    light: 'M15.1058 0.408834C14.5723 0.265892 14.024 0.582475 13.881 1.11594L13.234 3.53076C13.091 4.06422 13.4076 4.61256 13.9411 4.7555C14.4746 4.89844 15.0229 4.58186 15.1658 4.04839L15.8129 1.63358C15.9558 1.10011 15.6392 0.551776 15.1058 0.408834ZM5.49994 11.9999C5.49994 15.5898 8.41009 18.4999 11.9999 18.4999C15.5898 18.4999 18.4999 15.5898 18.4999 11.9999C18.4999 8.41009 15.5898 5.49994 11.9999 5.49994C8.41009 5.49994 5.49994 8.41009 5.49994 11.9999ZM16.4999 11.9999C16.4999 14.4852 14.4852 16.4999 11.9999 16.4999C9.51466 16.4999 7.49994 14.4852 7.49994 11.9999C7.49994 9.51466 9.51466 7.49994 11.9999 7.49994C14.4852 7.49994 16.4999 9.51466 16.4999 11.9999ZM8.83406 19.9515C8.977 19.418 9.52534 19.1014 10.0588 19.2444C10.5923 19.3873 10.9088 19.9357 10.7659 20.4691L10.1189 22.8839C9.97592 23.4174 9.42758 23.734 8.89412 23.5911C8.36065 23.4481 8.04407 22.8998 8.18701 22.3663L8.83406 19.9515ZM4.13873 15.3839C4.61702 15.1078 5.22861 15.2717 5.50475 15.7499C5.7809 16.2282 5.61702 16.8398 5.13873 17.116L2.97366 18.366C2.49537 18.6421 1.88378 18.4782 1.60764 17.9999C1.3315 17.5217 1.49537 16.9101 1.97366 16.6339L4.13873 15.3839ZM22.3922 5.99994C22.1161 5.52165 21.5045 5.35778 21.0262 5.63392L18.8612 6.88392C18.3829 7.16006 18.219 7.77165 18.4951 8.24994C18.7713 8.72824 19.3829 8.89211 19.8612 8.61597L22.0262 7.36597C22.5045 7.08983 22.6684 6.47824 22.3922 5.99994ZM4.04839 8.83406C4.58186 8.977 4.89844 9.52534 4.7555 10.0588C4.61256 10.5923 4.06422 10.9088 3.53076 10.7659L1.11594 10.1189C0.582475 9.97592 0.265892 9.42758 0.408834 8.89412C0.551776 8.36065 1.10011 8.04407 1.63358 8.18701L4.04839 8.83406ZM23.5911 15.1058C23.734 14.5723 23.4174 14.024 22.8839 13.881L20.4691 13.234C19.9357 13.091 19.3873 13.4076 19.2444 13.9411C19.1014 14.4746 19.418 15.0229 19.9515 15.1658L22.3663 15.8129C22.8998 15.9558 23.4481 15.6392 23.5911 15.1058ZM8.61597 4.13873C8.89211 4.61702 8.72824 5.22861 8.24994 5.50475C7.77165 5.7809 7.16006 5.61702 6.88392 5.13873L5.63392 2.97366C5.35778 2.49537 5.52165 1.88378 5.99994 1.60764C6.47824 1.3315 7.08983 1.49537 7.36597 1.97366L8.61597 4.13873ZM17.9999 22.3922C18.4782 22.1161 18.6421 21.5045 18.366 21.0262L17.116 18.8612C16.8398 18.3829 16.2282 18.219 15.7499 18.4951C15.2717 18.7713 15.1078 19.3829 15.3839 19.8612L16.6339 22.0262C16.9101 22.5045 17.5217 22.6684 17.9999 22.3922Z'
  }

  const [isMenuOpen, setIsMenuOpen] = useState(false);
  const [theme, setTheme] = useState('light');

  const toggleTheme = () => {
    if (theme === 'light') {
      setTheme('dark');
    } else if (theme === 'dark') {
      setTheme('system');
    } else {
      setTheme('light');
    }
  }

  return (
    <>
      <header>
        <div className="container mx-auto px-5 md:px-7 lg:px-10">
          <div className="flex h-16 items-center justify-between">
            <a href="/" className="text-2xl font-bold">KAMISH</a>

            <nav className="hidden lg:flex items-center space-x-8">
              {
                url.map((el) => (
                  <a href={el.link} target={el.target} className="text-sm font-medium">{el.name}</a>
                ))
              }
            </nav>

            <button onClick={() => setIsMenuOpen(!isMenuOpen)} className='border border-[#191919] hover:border-[#2a2a2a] hover:bg-[#111111] px-1.5 py-2 rounded-md text-[20px] font-medium transition duration-300 ease-in-out'>
              <img src="icon/menu.png" alt="menu" className="w-8 h-6"/>
            </button>
          </div>
        </div>
      </header>

      <ul className={
        isMenuOpen ? 'menu flex flex-col rounded-[15px] w-[350px] md:w-[300px]' : 'hidden'
      }> {
            window.innerWidth <= 1019 ? (<>
              {
              url.map((el) => (
                <li key={el.title}>
                  <a href={el.link} className='tektur text-[20px] flex items-center p-[15px] md:p-[20px] space-x-2 rounded-[10px] hover:bg-[#2a2a2a]' 
                    onClick={() => setIsMenuOpen(false)}> {el.name} 
                  </a>
                </li>
              ))
              }

              <div className="pt-2 pb-2">
                <hr className='bg-[#2a2a2a] border-[#2a2a2a] h-[1px]'/>
              </div>
            </>) : []
        }
        {
          link.map((el) => (
            <li key={el.title}>
              <a href={el.link} className='tektur text-[20px] flex items-center p-[15px] md:p-[20px] space-x-2 rounded-[10px] hover:bg-[#2a2a2a]' onClick={toggleTheme}>
                <svg width="24" height="24" viewBox="0 0 24 24" fill="none" focusable="false" aria-hidden="true">
                  <path fillRule="evenodd" clipRule="evenodd" d={theme == 'system' ? svg.system : theme == 'dark' ? svg.dark : svg.light} fill="currentColor"></path>
                </svg>
                <span>{el.name}</span>
              </a>
            </li>
          ))
        }
      </ul>
    </>
  )
}

export default Header